Repository: Lattay/indent
Catalog: po/*.po
Languages: nb_no, ro, uk

source: usage: indent file [-o outfile ] [ options ]
ro: folosire: fiºier indent [-o fiºier_ieºire ] [ opþiuni ]
uk: використання: indent файл [-o файл_виводу ] [ ключі ]

source: indent file1 file2 ... fileN [ options ]
ro: fiºier indent fiºier1 fiºier2...fiºierN [ opþiuni ]
uk: indent файл1 файл2 ... файлN [ ключі ]

source: indent: missing argument to parameter %s
ro: indent: argument lipsã la parametrul %s
uk: indent: відсутній аргумент у ключа %s

source: indent: unknown option "%s"
ro: indent: opþiune necunoscutã "%s"
uk: indent: невідомий ключ "%s"

source: option: %s
nb_no: valg: %s
ro: opþiune: %s
uk: ключ: %s

source: indent: option ``%s'' requires a numeric parameter
ro: indent: opþiunea ``%s'' necesitã un parametru numeric
uk: indent: для параметр ''%s'' треба вказати числовий параметр

source: indent: set_option: internal error: p_type %d
ro: indent: set_option: eroare internã: p_type %d
uk: indent: set_option: внутрішня помилка: p_type %d

source: Profile contains an unterminated comment
ro: Profilul conþine un comentariu neterminat
uk: Профіль містить неприпустимі символи

source: Profile contains unpalatable characters
nb_no: Profilen inneholder uspiselige tegn
ro: Profilul conþine caractere nepalatabile
uk: Профіль містить неприпустимі символи

source: indent: Strange version-control value
nb_no: indent: Rar versjonskontrollverdi
ro: indent: Valoare ciudatã de control-versiune
uk: indent: Дивне значення версії

source: indent: Using numbered-existing
nb_no: indent: Bruker "numbered-existing"
ro: indent: Folosire numerotate-existente
uk: indent: використовуються наявні числа

source: indent: Can't make backup filename of %s
ro: indent: Nu pot face nume_fiºier de backup al %s
uk: indent: Не вдається створити резервну копію файлу %s

source: Can't open backup file %s
ro: Nu pot deschide fiºierul de backup %s
uk: Не вдається відкрити резервну копію файлу %s

source: Can't write to backup file %s
nb_no: Kan ikke skrive til sikkerhetskopifil %s
ro: Nu pot scrie în fiºierul de backup %s
uk: Не вдається записати резервну копію файлу %s

source: Can't preserve modification time on backup file %s
nb_no: Kan ikke bevare endringstid for sikkerhetskopifilen %s
ro: Nu pot pãstra data modificãrii fiºierului de backup %s
uk: Не вдається змінити дату зміни файлу резервної копії %s

source: indent: Virtual memory exhausted.
nb_no: indent: Slapp opp for virtuelt minne.
ro: indent: Memorie virtualã plinã.
uk: indent: Скінчилась віртуальна пам'ять

source: indent: Fatal Error:
nb_no: indent: Uopprettelig feil:
ro: indent: Eroare fatalã:
uk: indent: Критична помилка

source: indent: System Error:
nb_no: indent: Systemfeil:
ro: indent: Eroare sistem:
uk: indent: Системна помилка:

source: Warning
nb_no: Advarsel
ro: Avertisment
uk: Попередження

source: Error
nb_no: Feil
ro: Eroare
uk: Помилка

source: Ran out of memory
ro: Am rãmas fãrã memorie
uk: Скінчилась пам'ять

source: EOF encountered in comment
nb_no: Kom over filslutt i kommentar
ro: EOF întâlnit în comentariu
uk: Кінець файлу всередині коментарю

source: Line broken
nb_no: Delt linje
ro: Linie întreruptã
uk: Рядок пошкоджений

source: Unexpected end of file
nb_no: Uventet slutt på fil
ro: Sfârºit de fiºier neaºteptat
uk: Несподіваний кінець файлу

source: There were %d non-blank output lines and %d comments
nb_no: Det ble funnet %d ikke-tomme utdatalinjer og %d kommentarer
ro: Au fost %d linii negoale(non-blank) ºi %d comentarii
uk: Було %d непорожніх вихідних рядків та %d коментарів

source: (Lines with comments)/(Lines with code): %6.3f
nb_no: (Linjer med kommentarer)/(Linjer med kode): %6.3f
ro: (Linii cu comentarii)/(Linii de cod): %6.3f
uk: (коментарі)/(код): %6.3f

source: Line broken 2
nb_no: Brutt linje 2
ro: Linie întreruptã 2
uk: Рядок зіпсований 2

source: Extra %c
ro: %c în plus(extra)
uk: Зайвий %c

source: Unmatched #else
ro: #else fãrã corespondent(unmatched)
uk: #else без пари

source: Unmatched #elif
ro: #elif fãrã corespondent(unmatched)
uk: #elif без пари

source: Unmatched #endif
ro: #endif fãrã corespondent(unmatched)
uk: #endif без пари

source: indent: only one output file (2nd was %s)
nb_no: indent: Kun én utdatafil (nr. 2 var %s)
ro: indent: doar un fiºier de output (al doilea a fost %s)
uk: indenr: лише один вихідний файл (другий був %s)

source: indent: only one input file when output file is specified
nb_no: indent: Kun én inndatafil når utdatafil er angitt
ro: indent: doar un fiºier de input când fiºier output e specificat
uk: indent: лише один вхідний файл, коли вказано файл виводу

source: indent: can't have filenames when specifying standard input
ro: indent: nu putem aveam nume_fiºiere când e specificat standard input
uk: indent: не можна вказувати назви файлів, коли вказано стандартний потік вводу

source: indent: only one input file when stdout is used
ro: indent: doar un fiºier de intrare când e folosit stdout
uk: indent: лише один вхідний файл, коли вказано стандартний потік вводу

source: Read profile %s
nb_no: Leste profilen %s
ro: Citeºte profil %s
uk: Читається профіль %s

source: Internal buffering error
ro: Eroare internã de buffering
uk: Внутрішня помилка буферизації

source: Can't open input file %s
nb_no: Kan ikke åpne inndatafilen %s
ro: Nu pot deschide fiºierul de intrare %s
uk: Не вдається відкрити вхідний файл %s

source: Can't stat input file %s
ro: Nu pot afla statistici despre fiºierul de intrare %s
uk: Не вдається отримати статус вхідного файлу %s

source: Warning: Zero-length file %s
ro: Avertisment: %s este fiºier de lungime 0
uk: Попередження: Файл %s має нульову довжину

source: File %s is too big to read
nb_no: Filen %s er for stor å lese
ro: Fiºierul %s este prea mare pentru a fi citit
uk: Файл %s надто великий

source: System problem reading file %s
nb_no: Systemproblem ved lesing av filen %s
ro: Problemã de sistem la citirea fiºierului %s
uk: Системна помилка читання файлу %s

source: Error reading input file %s
nb_no: Feil ved lesing av inndatafilen %s
ro: Eroare la citirea fiºierului de intrare %s
uk: Помилка читання вхідного файлу %s

source: Error closeing input file %s
ro: Eroare la închiderea fiºierului de intrare %s
uk: Помилка закриття вхідного файлу %s

source: Warning: File %s contains NULL-characters
ro: Avertisment: Fiºierul %s conþine caractere NULL
uk: Попередження: Файл %s містить нульові символи

source: Unterminated character constant
ro: Constantã caracter neterminatã
uk: Незавершена символьна константа

source: Unterminated string constant
ro: Constantã ºir neterminatã
uk: Незавершена символьна константа

source: old style assignment ambiguity in "=%c". Assuming "= %c"
ro: atribuire ambiguã stil vechi în "=%c". Se presupune "= %c"
uk: призначення у старому стилі неоднозначне у "=%c". Вважається "= %c"

source: indent: can't create %s
nb_no: indent: Kan ikke opprette %s
ro: indent: nu pot crea %s
uk: indent: не вдається створити %s

source: Can't close output file %s
ro: Nu pot închide fiºierul de output %s
uk: Не вдається відкрити вхідний файл %s

source: Can't preserve modification time on output file %s
nb_no: Kan ikke bevare endringstid for utdatafilen %s
ro: Nu pot pãstra data modificãrii fiºierului de output %s
uk: Не вдається зберегти час зміни вхідного файлу %s

source: Unmatched 'else'
ro: 'else' fãrã corespondent
uk: 'else' без пари

source: Stmt nesting error.
ro: Eroare nesting stmt.
uk: Помилка вкладення stmt

source: Unknown code to parser
ro: Cod necunoscut în analizor(parser)
uk: Невідомий для аналізатора код

source: stack[%d] => stack: %d ind_level: %d
ro: stivã(stack)[%d] => stivã: %d ind_level: %d
uk: стек[%d] => стек: %d рівень_вклад: %d

source: CANNOT FIND '@' FILE!
ro: NU POT GÃSI FIªIERUL '@'!
uk: НЕ ВДАЄТЬСЯ ЗНАЙТИ ФАЙЛ '@'!

source: usage: indent file [-o outfile ] [ options ] indent file1 file2 ... fileN [ options ]
nb_no: bruk: indent fil [-o utdatafil ] [ valg ] indent fil1 fil2 ... filN [ valg ]

source: %s: missing argument to parameter %s
nb_no: %s: manglende argument til parameteret %s

source: %s: unknown option "%s"
nb_no: %s: ukjent valg "%s"

source: %s: option ``%s'' requires a numeric parameter
nb_no: %s: valget ``%s'' krever numerisk parameter

source: set_option: internal error: p_type %d
nb_no: set_option: Intern feil: p_type %d

source: File named by environment variable %s does not exist or is not readable
nb_no: Fil navngitt av miljøvariabelen %s ser ikke ut til å finnes eller å være lesbar

source: command line
nb_no: kommandolinje

source: Error closing input file %s
nb_no: Feil ved lukking av inndatafilen %s

source: File %s contains NULL-characters: cannot proceed
nb_no: Filen %s inneholder NULL-tegn: Kan ikke fortsette
